pascal-3.1/tutorials/surfaceTracking/interTrackMHDmagFoam/slantingGgi2D/0.org/region_fluid/motionU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.1                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       tetPointVectorField;
    object      motionU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [0 1 -1 0 0 0 0];

internalField       uniform (0 0 0);

boundaryField
{
    trackedSurface
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    movingWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    fixedWall
    {
        type            slip;
    }
    frontAndBack
    {
        type            empty;
    }
    "procBoundary.*"
    {
        type            processor;
        value           uniform 0;
    }
    global
    {
        type            global;
    }
}

// ************************************************************************* //